nixidee/ESP32-Soiltest/Claude/src/main.cpp
    if (voltage >= max_voltage) return 100;
    if (voltage <= min_voltage) return 0;
    
    return (uint8_t)((voltage - min_voltage) / (max_voltage - min_voltage) * 100);
}

/**
 * Liest alle Sensordaten
 */
void readSensorData() {
    ESP_LOGI(TAG, "Lese Sensordaten...");
    
    // Bodenfeuchte-Sensor einschalten
    digitalWrite(SOIL_SENSOR_POWER_PIN, HIGH);
    delay(100); // Stabilisierung
    
    // Bodenfeuchte lesen (mehrere Messungen für Stabilität)
    uint32_t soil_sum = 0;
    for(int i = 0; i < 5; i++) {
        soil_sum += analogRead(SOIL_SENSOR_PIN);
        delay(10);
    }
    current_data.soil_moisture = soil_sum / 5;
    current_data.soil_category = categorizeSoilMoisture(current_data.soil_moisture);
    
    // Bodenfeuchte-Sensor ausschalten (Stromsparend)
    digitalWrite(SOIL_SENSOR_POWER_PIN, LOW);
    
    // BME280 Daten lesen
    if (bme.takeForcedMeasurement()) {
        current_data.temperature = bme.readTemperature();
        current_data.humidity = bme.readHumidity();
        current_data.pressure = bme.readPressure() / 100.0F; // Pa zu hPa
        current_data.abs_humidity = calculateAbsoluteHumidity(
            current_data.temperature, current_data.humidity);
    } else {
        ESP_LOGE(TAG, "BME280 Messung fehlgeschlagen!");
    }
    
    // Batterie lesen
    current_data.battery_voltage = readBatteryVoltage();
    current_data.battery_percent = calculateBatteryPercent(current_data.battery_voltage);
    
    // Ladespannung (falls verfügbar über USB)
    // Hinweis: FireBeetle 2 hat keinen direkten Zugriff auf VIN wenn über Batterie betrieben
    current_data.charge_voltage = 0.0; // Implementierung board-spezifisch
    
    // Debug Ausgabe
    ESP_LOGI(TAG, "=== Sensordaten ===");
    ESP_LOGI(TAG, "Temperatur: %.2f °C", current_data.temperature);
    ESP_LOGI(TAG, "Luftfeuchtigkeit: %.2f %%", current_data.humidity);
    ESP_LOGI(TAG, "Luftdruck: %.2f hPa", current_data.pressure);
    ESP_LOGI(TAG, "Abs. Luftfeuchtigkeit: %.2f g/m³", current_data.abs_humidity);
    ESP_LOGI(TAG, "Bodenfeuchte: %d (ADC) - %s", 
            current_data.soil_moisture, 
            soilCategoryToString(current_data.soil_category));
    ESP_LOGI(TAG, "Batterie: %.2fV (%d%%)", 
            current_data.battery_voltage, 
            current_data.battery_percent);
}

// ==================== ZIGBEE FUNKTIONEN ====================

/**
 * Zigbee Stack Signal Handler
 */
static void esp_zb_app_signal_handler(esp_zb_app_signal_t *signal_struct) {
    uint32_t *p_sg_p = signal_struct->p_app_signal;
    esp_err_t err_status = signal_struct->esp_err_status;
    esp_zb_app_signal_type_t sig_type = *p_sg_p;
    
    switch (sig_type) {
        case ESP_ZB_ZDO_SIGNAL_SKIP_STARTUP:
            ESP_LOGI(TAG, "Zigbee stack initialized");
            esp_zb_bdb_start_top_level_commissioning(ESP_ZB_BDB_MODE_INITIALIZATION);
            break;
            
        case ESP_ZB_BDB_SIGNAL_DEVICE_FIRST_START:
        case ESP_ZB_BDB_SIGNAL_DEVICE_REBOOT:
            if (err_status == ESP_OK) {
                ESP_LOGI(TAG, "Start network steering");
                esp_zb_bdb_start_top_level_commissioning(ESP_ZB_BDB_MODE_NETWORK_STEERING);
            } else {
                ESP_LOGE(TAG, "Failed to initialize Zigbee stack (status: %d)", err_status);
            }
            break;
            
        case ESP_ZB_BDB_SIGNAL_STEERING:
            if (err_status == ESP_OK) {
                ESP_LOGI(TAG, "Joined network successfully");
                zigbee_initialized = true;
                digitalWrite(LED_PIN, HIGH); // LED an wenn verbunden
            } else {
                ESP_LOGI(TAG, "Network steering was not successful (status: %d)", err_status);
                esp_zb_scheduler_alarm((esp_zb_callback_t)esp_zb_bdb_start_top_level_commissioning, 
                                     ESP_ZB_BDB_MODE_NETWORK_STEERING, 1000);
            }
            break;
            
        case ESP_ZB_COMMON_SIGNAL_CAN_SLEEP:
            ESP_LOGI(TAG, "Zigbee can sleep");
            // Hier könnten wir Light Sleep aktivieren
            // esp_zb_sleep_now();
            break;
            
        default:
            ESP_LOGI(TAG, "ZDO signal: %d, status: %d", sig_type, err_status);
            break;
    }
}

/**
 * Zigbee Attribute setzen
 */
static void esp_zb_set_attributes(void) {
    // Basic Cluster Attribute
    esp_zb_attribute_list_t *basic_cluster = esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_BASIC);
    esp_zb_basic_cluster_add_attr(basic_cluster, ESP_ZB_ZCL_ATTR_BASIC_MANUFACTURER_NAME_ID, 
                                 (void *)MANUFACTURER_NAME);
    esp_zb_basic_cluster_add_attr(basic_cluster, ESP_ZB_ZCL_ATTR_BASIC_MODEL_IDENTIFIER_ID, 
                                 (void *)MODEL_IDENTIFIER);
    uint8_t power_source = 0x03; // Battery
    esp_zb_basic_cluster_add_attr(basic_cluster, ESP_ZB_ZCL_ATTR_BASIC_POWER_SOURCE_ID, 
                                 &power_source);
    
    // Temperature Measurement Cluster
    esp_zb_attribute_list_t *temperature_cluster = 
        esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT);
    int16_t temp_value = (int16_t)(current_data.temperature * 100);
    esp_zb_temperature_meas_cluster_add_attr(temperature_cluster, 
        ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID, &temp_value);
    int16_t temp_min = -4000; // -40°C
    esp_zb_temperature_meas_cluster_add_attr(temperature_cluster,
        ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_MIN_VALUE_ID, &temp_min);
    int16_t temp_max = 12500; // 125°C  
    esp_zb_temperature_meas_cluster_add_attr(temperature_cluster,
        ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_MAX_VALUE_ID, &temp_max);
    
    // Humidity Measurement Cluster
    esp_zb_attribute_list_t *humidity_cluster = 
        esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_REL_HUMIDITY_MEASUREMENT);
    uint16_t humidity_value = (uint16_t)(current_data.humidity * 100);
    esp_zb_humidity_meas_cluster_add_attr(humidity_cluster,
        ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_VALUE_ID, &humidity_value);
    uint16_t humidity_min = 0;
    esp_zb_humidity_meas_cluster_add_attr(humidity_cluster,
        ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_MIN_VALUE_ID, &humidity_min);
    uint16_t humidity_max = 10000; // 100%
    esp_zb_humidity_meas_cluster_add_attr(humidity_cluster,
        ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_MAX_VALUE_ID, &humidity_max);
    
    // Pressure Measurement Cluster (Custom)
    esp_zb_attribute_list_t *pressure_cluster = 
        esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_PRESSURE_MEASUREMENT);
    int16_t pressure_value = (int16_t)(current_data.pressure * 10);
    esp_zb_custom_cluster_add_custom_attr(pressure_cluster, 0x0000, 
        ESP_ZB_ZCL_ATTR_TYPE_S16, ESP_ZB_ZCL_ATTR_ACCESS_READ_ONLY | ESP_ZB_ZCL_ATTR_ACCESS_REPORTING,
        &pressure_value);
    
    // Power Configuration Cluster (Battery)
    esp_zb_attribute_list_t *power_cfg_cluster = 
        esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_POWER_CONFIG);
    uint8_t battery_voltage_raw = (uint8_t)(current_data.battery_voltage * 10); // 0.1V units
    esp_zb_power_config_cluster_add_attr(power_cfg_cluster,
        ESP_ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_VOLTAGE_ID, &battery_voltage_raw);
    uint8_t battery_percentage = current_data.battery_percent * 2; // 0.5% units
    esp_zb_power_config_cluster_add_attr(power_cfg_cluster,
        ESP_ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_PERCENTAGE_REMAINING_ID, &battery_percentage);
    
    // Analog Input Cluster für Bodenfeuchte
    esp_zb_attribute_list_t *analog_input_cluster = 
        esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_ANALOG_INPUT);
    float soil_moisture_scaled = (float)current_data.soil_moisture / 4095.0 * 100.0;
    esp_zb_analog_input_cluster_add_attr(analog_input_cluster,
        ESP_ZB_ZCL_ATTR_ANALOG_INPUT_PRESENT_VALUE_ID, &soil_moisture_scaled);
    
    // Cluster Liste erstellen
    esp_zb_cluster_list = esp_zb_zcl_cluster_list_create();
    esp_zb_cluster_list_add_basic_cluster(esp_zb_cluster_list, basic_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
    esp_zb_cluster_list_add_temperature_meas_cluster(esp_zb_cluster_list, temperature_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
    esp_zb_cluster_list_add_humidity_meas_cluster(esp_zb_cluster_list, humidity_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
    esp_zb_cluster_list_add_pressure_meas_cluster(esp_zb_cluster_list, pressure_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
    esp_zb_cluster_list_add_power_config_cluster(esp_zb_cluster_list, power_cfg_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
    esp_zb_cluster_list_add_analog_input_cluster(esp_zb_cluster_list, analog_input_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
}

/**
 * Sendet Zigbee Report mit aktuellen Sensordaten
 */
void sendZigbeeReport() {
    if (!zigbee_initialized) {
        ESP_LOGW(TAG, "Zigbee nicht initialisiert, überspringe Report");
        return;
    }
    
    ESP_LOGI(TAG, "Sende Zigbee Report...");
    
    // Temperature Report
    esp_zb_zcl_report_attr_cmd_t temp_cmd = {
        .zcl_basic_cmd = {
            .dst_addr_u.addr_short = 0x0000, // Coordinator
            .dst_endpoint = 1,
            .src_endpoint = ENDPOINT_ID,
        },
        .address_mode = ESP_ZB_APS_ADDR_MODE_16_ENDP_PRESENT,
        .clusterID = ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT,
        .attributeID = ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID,
        .cluster_role = ESP_ZB_ZCL_CLUSTER_SERVER_ROLE,
    };
    esp_zb_zcl_report_attr_cmd_req(&temp_cmd);
    
    // Humidity Report
    esp_zb_zcl_report_attr_cmd_t humidity_cmd = temp_cmd;
    humidity_cmd.clusterID = ESP_ZB_ZCL_CLUSTER_ID_REL_HUMIDITY_MEASUREMENT;
    humidity_cmd.attributeID = ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_VALUE_ID;
    esp_zb_zcl_report_attr_cmd_req(&humidity_cmd);
    
    // Weitere Reports für andere Cluster...
    
